books = [
    {"title": "Ромео и Джульетта", "author": "Шекспир", "year": 1765},
    {"title": "Дом в котором", "author": "Мариам Петросян", "year": 2009},
    {"title": "Преступление и наказание", "author": "Федор Достоевский", "year": 1866},
    {"title": "Капитанская дочка", "author": "Александр Пушкин", "year": 1836},
    {"title": "Война и мир", "author": "Лев Толстой", "year": 1869}
]

for i in range(len(books)):
    print(f"---------------------- Книга {i + 1} -----------------------")
    print(f"Название: {books[i]['title']}, Автор: {books[i]['author']},")
    print(f"------------------------- {books[i]['year']} -------------------------")
