books = [ # список из словарей
    {"title": "Ромео и Джульетта", "author": "Шекспир", "year": 1765}, # 1 словарь
    {"title": "Дом в котором", "author": "Мариам Петросян", "year": 2009}, # 2
    {"title": "Преступление и наказание", "author": "Федор Достоевский", "year": 1866}, # 3
    {"title": "Капитанская дочка", "author": "Александр Пушкин", "year": 1836}, # 4
    {"title": "Война и мир", "author": "Лев Толстой", "year": 1869} # 5
] 

for i in range(len(books)): #перебор элементов
    print(f"---------------------- Книга {i + 1} -----------------------") # выводим
    print(f"Название: {books[i]['title']}, Автор: {books[i]['author']},") # выводим с ключами
    print(f"------------------------- {books[i]['year']} -------------------------") # выводим
